In [1]:
import pandas as pd

In [3]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

numbers = pd.Series([4, 8, 15, 16, 23, 42])
numbers

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(numbers)

pandas.core.series.Series

In [10]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

list1 = [i for i in range(50,60)]

number_series = pd.Series(list1)

number_series

0    50
1    51
2    52
3    53
4    54
5    55
6    56
7    57
8    58
9    59
dtype: int64

In [11]:
type(number_series)

pandas.core.series.Series

In [12]:
# Q3. Create a Pandas DataFrame that contains the following data:

name = pd.Series(['Alice', 'Bob', 'Claire'])
age = pd.Series([25, 30, 27])
gender = pd.Series(['Female', 'Male', 'Female'])

frame = {'Name':name,
         'Age':age,
         'Gender':gender,}

df = pd.DataFrame(frame)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""
Dataframe are 2 Dimentional data structure build using dictionary and numbers of Series. 
It basically displays the values in the form of structured table like SQL.

Dataframe are different form Series that they are 2D and Series are 1D. 
Indexs in Dataframe are not defined or be opetional but in Series Indexs are defined just like a Python List.
"""

"""
Using the above Dataframe and Series for example the Series 'name', 'age', 'gender' are 1D Series 
and DataFrame 'df' is made using 3 Series to form a 2D table like representation
"""

print(f"type of Series 'name' is {type(name)}")
print(f"type of DataFrame 'df' is {type(df)}")
print("\n And \n")
print(f"shape of Series 'name' is 1D {name.shape}")
print(f"shape of DataFrame 'df' is 2D {df.shape}")

type of Series 'name' is <class 'pandas.core.series.Series'>
type of DataFrame 'df' is <class 'pandas.core.frame.DataFrame'>

 And

shape of Series 'name' is 1D (3,)
shape of DataFrame 'df' is 2D (3, 3)

In [21]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

"""
Some of the basic pandas functionality are
"""

'\nSome of the basic pandas functionality are\n'

In [22]:
df2 = pd.read_csv("cities.csv")

In [23]:
df2.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [24]:
df2.tail()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
123,39,31,12,"""N""",119,48,35,"""W""","""Reno""",NV
124,50,25,11,"""N""",104,39,0,"""W""","""Regina""",SA
125,40,10,48,"""N""",122,14,23,"""W""","""Red Bluff""",CA
126,40,19,48,"""N""",75,55,48,"""W""","""Reading""",PA
127,41,9,35,"""N""",81,14,23,"""W""","""Ravenna""",OH

In [27]:
df2.shape, df.size, df.ndim

((128, 10), 9, 2)

In [28]:
df2.dtypes

LatD         int64
 "LatM"      int64
 "LatS"      int64
 "NS"       object
 "LonD"      int64
 "LonM"      int64
 "LonS"      int64
 "EW"       object
 "City"     object
 "State"    object
dtype: object

In [30]:
df2.columns

Index(['LatD', ' "LatM"', ' "LatS"', ' "NS"', ' "LonD"', ' "LonM"', ' "LonS"',
       ' "EW"', ' "City"', ' "State"'],
      dtype='object')

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   LatD      128 non-null    int64
 1    "LatM"   128 non-null    int64
 2    "LatS"   128 non-null    int64
 3    "NS"     128 non-null    object
 4    "LonD"   128 non-null    int64
 5    "LonM"   128 non-null    int64
 6    "LonS"   128 non-null    int64
 7    "EW"     128 non-null    object
 8    "City"   128 non-null    object
 9    "State"  128 non-null    object
dtypes: int64(6), object(4)
memory usage: 10.1+ KB

In [35]:
df2.to_csv('updated_city.csv',index=False)

In [37]:
"""
Following are some basic pandas functionality
"""

'\nFollowing are some basic pandas functionality\n'

In [38]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

"""
All of the Three Series, DataFrame, and Panel are mutable in nature we can edit andy values in any of the file.
1. In Series data can be edited just like a list using pandas commands
2. DataFrames can be edited in dataframe table using pandas command for manipulation
3. Panels are 3D containers of data and can be created and edited in form of ndarray
"""

'\nAll of the Three Series, DataFrame, and Panel are mutable in nature we can edit andy values in any of the file.\n1. In Series data can be edited just like a list using pandas commands\n2. DataFrames can be edited in dataframe table using pandas command for manipulation\n3. Panels are 3D containers of data and can be created and edited in form of ndarray\n'

In [39]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

"""
Creating a DataFrame using multiple Series.

Series are 1D List which i used as a column for a DataFrame

DataFrame is a 2D tabular data format just like SQL tables and can perform all types of data manipulation commands like SQL.

"""

name = pd.Series(['Alexa', 'Google', 'Bixby', 'Siri', 'Cortana'])
brand = pd.Series(['Amazon', 'Google', 'Samsung', 'Apple', 'Microsoft'])
support = pd.Series(['Amazon_IOT', 'Android', 'Galaxy', 'Idevies', 'Windows'])

chatbot = pd.DataFrame({"Company":brand,"Assistant":name, "Support":support})

In [40]:
chatbot

     Company Assistant     Support
0     Amazon     Alexa  Amazon_IOT
1     Google    Google     Android
2    Samsung     Bixby      Galaxy
3      Apple      Siri     Idevies
4  Microsoft   Cortana     Windows

In [41]:
"""
In above chatbot DataFrame.
I have used 3 Series named (name,brand,support)
"""

'\nIn above chatbot DataFrame.\nI have used 3 Series named (name,brand,support)\n'